const rulesAndRegulations = [
  {
    title: 'پذیرش شرایط',
    description:
      'با ثبت‌نام و استفاده از خدمات، کاربران موافقت خود را با قوانین و مقررات اعلام می‌کنند. این قوانین ممکن است در هر زمان تغییر کنند. ادامه استفاده از خدمات پس از اعمال تغییرات به معنای پذیرش آنها است.',
  },
  {
    title: 'حریم خصوصی و اطلاعات کاربران',
    description:
      'اطلاعات کاربران با رعایت کامل اصول حریم خصوصی جمع‌آوری و ذخیره می‌شود. اطلاعات شخصی کاربران بدون اجازه آنها به اشخاص ثالث منتقل نخواهد شد، مگر در مواردی که قانون الزام کند.',
  },
  {
    title: 'شرایط استفاده از خدمات',
    description:
      'کاربران موظف‌اند در زمان استفاده از خدمات، از وارد کردن اطلاعات صحیح و معتبر اطمینان حاصل کنند. استفاده از خدمات برای اهداف غیرقانونی، غیراخلاقی یا آسیب‌رسان به دیگران اکیداً ممنوع است. هرگونه تلاش برای نقض امنیت سیستم، کپی‌برداری غیرمجاز، یا دخالت در عملکرد خدمات تخلف محسوب می‌شود و با آن برخورد قانونی خواهد شد.',
  },
  {
    title: 'حقوق و مسئولیت‌ها',
    description:
      'کاربران مسئولیت کامل محتوای تولید یا به اشتراک گذاشته‌شده خود را برعهده دارند. هرگونه انتشار محتوای توهین‌آمیز، غیرقانونی، یا نقض‌کننده حقوق دیگران ممنوع است.',
  },
  {
    title: 'دسترسی و محدودیت‌ها',
    description:
      'ارائه خدمات ممکن است به دلایل فنی، امنیتی یا شرایط خارج از کنترل، به‌صورت موقت یا دائم محدود شود. سرویس‌دهنده حق دارد دسترسی کاربران متخلف را بدون اطلاع قبلی محدود یا مسدود کند.',
  },
  {
    title: 'مالکیت معنوی',
    description:
      'تمامی حقوق مربوط به نرم‌افزار، محتوا، و خدمات ارائه‌شده (شامل طراحی، لوگو، و محتوای متنی یا تصویری) متعلق به ارائه‌دهنده خدمات است و هرگونه استفاده تجاری یا غیرمجاز از آنها ممنوع است.',
  },
  {
    title: 'پرداخت‌ها و بازگشت وجه',
    description:
      'در صورت پرداخت هزینه برای استفاده از خدمات خاص، مبلغ پرداختی غیرقابل استرداد است مگر در شرایط خاص که توسط سرویس‌دهنده تعیین می‌شود.',
  },
  {
    title: 'قوانین مرتبط با ارتباطات کاربران',
    description:
      'کاربران موظف‌اند در ارتباطات خود (مانند نظرات یا پیام‌ها) از زبان مناسب استفاده کنند. هرگونه ارسال پیام تبلیغاتی یا اسپم از طریق خدمات ممنوع است.',
  },
  {
    title: 'ضمانت و مسئولیت',
    description:
      'سرویس‌دهنده تلاش می‌کند خدمات را با بالاترین کیفیت ممکن ارائه دهد اما هیچ‌گونه ضمانتی در خصوص عاری بودن از خطا یا اشکال فنی ارائه نمی‌کند. مسئولیت استفاده نادرست از خدمات به‌عهده کاربران است.',
  },
  {
    title: 'قطع خدمات و فسخ حساب کاربری',
    description:
      'ارائه‌دهنده خدمات حق دارد در صورت تخلف، نقض قوانین، یا شرایط اضطراری، دسترسی کاربران را به‌صورت موقت یا دائم محدود یا لغو کند.',
  },
  {
    title: 'شرایط قانونی',
    description:
      'تمامی فعالیت‌ها و استفاده از خدمات باید مطابق با قوانین جاری کشور باشد. در صورت بروز اختلاف، موضوع در مراجع قانونی ذی‌صلاح رسیدگی خواهد شد.',
  },
  {
    title: 'توصیه نهایی',
    description:
      'با مطالعه و رعایت این قوانین، ما را در ارائه خدمات بهتر یاری کنید. در صورت بروز سوال یا نیاز به پشتیبانی، لطفاً با ما تماس بگیرید.',
  },
];

export default rulesAndRegulations;
